Programação Web/T5/app/controllers/addresses_controller.rb

INSERT INTO "addresses" ("streat", "number", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["streat", "teste"], ["number", 1], ["student_id", 1], ["created_at", "2023-06-01 01:16:56.834799"], ["updated_at", "2023-06-01 01:16:56.834799"]]
---
  def create
    @address = Address.new(address_params)

    respond_to do |format|
      if @address.save