Programação Web/T5/app/controllers/colleges_controller.rb

SELECT "colleges".* FROM "colleges"
---
  def index
    @colleges = College.all

INSERT INTO "colleges" ("name", "c_type", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "teste"], ["c_type", "teste"], ["created_at", "2023-06-01 01:15:30.342669"], ["updated_at", "2023-06-01 01:15:30.342669"]]
---
  def create
    @college = College.new(college_params)

    respond_to do |format|
      if @college.save

DELETE FROM "colleges" WHERE "colleges"."id" = ?  [["id", 1]]
---
  def destroy
    @college.destroy

SELECT "colleges".* FROM "colleges" WHERE "colleges"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_college
    @college = College.find(params[:id])