Programação Web/T5/app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "age", "register", "college_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "teste"], ["age", 12], ["register", "teste"], ["college_id", 1], ["created_at", "2023-06-01 01:15:50.972693"], ["updated_at", "2023-06-01 01:15:50.972693"]]