Programação Web/T5/app/controllers/students_subjects_controller.rb

SELECT "students_subjects".* FROM "students_subjects"
---
  def index
    @students_subjects = StudentsSubject.all

INSERT INTO "students_subjects" ("student_id", "subject_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["student_id", 1], ["subject_id", 1], ["created_at", "2023-06-01 01:24:57.469461"], ["updated_at", "2023-06-01 01:24:57.469461"]]
---
  def create
    @students_subject = StudentsSubject.new(students_subject_params)

    respond_to do |format|
      if @students_subject.save

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "students_subjects".* FROM "students_subjects" WHERE "students_subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_students_subject
    @students_subject = StudentsSubject.find(params[:id])