Programação Web/T5/app/controllers/subjects_controller.rb

INSERT INTO "subjects" ("name", "code", "college_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "teste"], ["code", "22"], ["college_id", 1], ["created_at", "2023-06-01 01:30:00.317795"], ["updated_at", "2023-06-01 01:30:00.317795"]]
---
  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save